{
  "experience": [
    {
      "company": "BiBank",
      "role": "DevOps Engineer | SRE",
      "period": "Mar 2024 – Present",
      "highlights": [
        "Modernization and standardization of CI/CD workflows through the design of controlled, parameterized pipelines, increasing deployment reliability and enabling self-service models across teams.",
        "Container orchestration improvements and platform stability across production environments.",
        "Implementation of centralized secrets management practices across distributed systems.",
        "Reorganization and reinforcement of observability through rapid visibility solutions, metric normalization via an internal service layer, and integration of threshold-based alerting into centralized monitoring systems, promoting technical adoption across teams."
      ],
      "technologies": "Azure · Kubernetes (AKS, k3s) · Helm · GitLab CI · Jenkins · Elastic Stack · Zabbix · Kuma · Vault · Consul · Harbor · Proxmox · Docker Swarm"
    },
    {
      "company": "Fpay",
      "role": "DevOps | SRE",
      "period": "Jan 2021 – Mar 2024",
      "highlights": [
        "DevOps point of contact for multiple backend and frontend teams, supporting the full deployment and operational lifecycle of microservices in production cloud environments.",
        "Evolution of the Infrastructure-as-Code and automation platform, strengthening pipelines and supporting the transition from Jenkins to GitLab CI.",
        "Operation and maintenance of Docker Swarm-based infrastructure on Azure, ensuring platform stability in distributed environments.",
        "Incident management across critical platform components, including API gateway (KongHQ), messaging systems, and managed data services such as MongoDB Atlas and BigQuery.",
        "Improvement of observability and monitoring practices (ELK, Datadog) during high-demand operational periods."
      ],
      "technologies": "Azure · GCP · Docker Swarm · Kubernetes · Terraform · Jenkins · GitLab CI · Chef · KongHQ ·ELK · Datadog · Vault · Cloudflare · MongoDB Atlas · BigQuery"
    },
    {
      "company": "Technisys",
      "role": "Backend Developer at Fpay",
      "period": "Sep 2019 – Jan 2021",
      "highlights": [
        "Backend development for a multi-country digital payment wallet, integrating financial services across regulated environments.",
        "Design and implementation of backend components for asynchronous payment transaction processing using messaging queues, handling persistence, transactional state management, and retry mechanisms.",
        "Implementation of integrations with external systems and collaboration on financial traceability and auditability.",
        "Collaboration with infrastructure teams on deployment, configuration, and service reliability."
      ],
      "technologies": "Node.js · Express · RabbitMQ · MySQL · Redis · Docker · Jenkins · Kong · Instana · JWT · MongoDB"
    },
    {
      "company": "Technisys",
      "role": "Frontend Developer at Banco Itaú",
      "period": "Jul 2016 – Aug 2019",
      "highlights": [
        "Development and maintenance of the Banco Itaú mobile banking application.",
        "Development of Angular/Ionic components and services to support multi-step operational flows and client-side validations.",
        "Resolution of cross-platform styling and compatibility issues using SASS.",
        "Integration of banking APIs and analytics tools, including participation in mobile build and store release processes (Android/iOS)."
      ],
      "technologies": "Angular · Ionic · TypeScript · RxJS · SASS · Cordova · REST APIs"
    },
    {
      "company": "DoWhale",
      "role": "Frontend Developer",
      "period": "Oct 2014 – Jul 2016",
      "highlights": [
        "Development of responsive, public-facing web applications.",
        "Integration with APIs and focus on performance and usability."
      ],
      "technologies": "JavaScript, HTML, CSS, responsive design, API integration."
    },
    {
      "company": "Freelance",
      "role": "System Consultant",
      "period": "Aug 2007 – Oct 2014",
      "highlights": [
        "System administration and infrastructure support for small and medium companies.",
        "Experience with servers, networking, virtualization and backups."
      ],
      "technologies": "Linux servers, Windows servers, networking equipment, virtualization platforms."
    },
    {
      "company": "Sirius IT Solutions",
      "role": "IT Store Owner",
      "period": "Jul 2011 - Oct 2013",
      "highlights": [
        "Hardware sales and system configuration.",
        "Technical support, network setup and ongoing monitoring."
      ]
    },
    {
      "company": "BullNet",
      "role": "IT Employee",
      "period": "Feb 2010 - Sep 2012",
      "highlights": [
        "Responsibilities included sales, customer support and systems configuration."
      ]
    },
        {
      "company": "Cybercafé Maniac",
      "role": "General Employee",
      "period": "Mar 2004 - Dec 2005",
      "highlights": [
        "Responsibilities included Customer support and network maintenance."
      ]
    }
  ]
}