{
  "experience": [
    {
      "company": "BiBank",
      "role": "DevOps Engineer | SRE",
      "period": "Mar 2024 – Presente",
      "highlights": [
        "Mejoré pipelines de CI/CD, aumentando la trazabilidad y seguridad operativa.",
        "Implementé estándares de monitoreo y observabilidad para sistemas productivos.",
        "Fortalecí las operaciones de Kubernetes y las prácticas de gestión de secretos.",
        "Habilité acceso self-service a flujos de despliegue e insights de sistemas, reduciendo la dependencia operativa."
      ],
      "environment": "Workloads containerizados, pipelines CI/CD, herramientas de observabilidad, gestión de secretos y operaciones de Kubernetes en producción."
    },
    {
      "company": "Fpay",
      "role": "DevOps | SRE",
      "period": "Ene 2021 – Mar 2024",
      "highlights": [
        "Operé y di soporte a infraestructura productiva y pipelines de despliegue.",
        "Trabajé en CI/CD, monitoreo, logging y prácticas de seguridad.",
        "Di soporte a los equipos de desarrollo, mejorando la confiabilidad y la visibilidad entre entornos."
      ],
      "environment": "Infraestructura cloud, plataformas de containers, automatización CI/CD, sistemas de monitoreo y logging, servicios de mensajería."
    },
    {
      "company": "Technisys",
      "role": "Backend Developer (Fpay)",
      "period": "Sep 2019 – Ene 2021",
      "highlights": [
        "Desarrollo backend para una plataforma de pagos multi-país.",
        "Integración con servicios externos y sistemas de mensajería.",
        "Colaboración con equipos de infraestructura y operaciones en aspectos de despliegue y confiabilidad."
      ],
      "technologies": "Node.js, message brokers, bases de datos relacionales y no relacionales."
    },
    {
      "company": "Technisys",
      "role": "Frontend Developer en Banco Itaú",
      "period": "Jul 2016 – Ago 2019",
      "highlights": [
        "Desarrollo y mantenimiento de aplicaciones de banca móvil.",
        "Integración con servicios backend y APIs REST.",
        "Experiencia trabajando en entornos regulados y de alta disponibilidad."
      ],
      "technologies": "Angular, Ionic, frameworks de desarrollo móvil, APIs RESTful."
    },
    {
      "company": "DoWhale",
      "role": "Frontend Developer",
      "period": "Oct 2014 – Jul 2016",
      "highlights": [
        "Desarrollo de aplicaciones web responsive orientadas al público.",
        "Integración con APIs y foco en performance y usabilidad."
      ],
      "technologies": "JavaScript, HTML, CSS, diseño responsive, integración de APIs."
    },
    {
      "company": "Freelance",
      "role": "Consultor de Sistemas",
      "period": "Ago 2007 – Oct 2014",
      "highlights": [
        "Administración de sistemas y soporte de infraestructura para pequeñas y medianas empresas.",
        "Experiencia con servidores, redes, virtualización y backups."
      ],
      "technologies": "Servidores Linux, servidores Windows, equipos de red, plataformas de virtualización."
    },
    {
      "company": "Sirius IT Solutions",
      "role": "Propietario de Tienda IT",
      "period": "Jul 2011 - Oct 2013",
      "highlights": [
        "Venta de hardware y configuración de sistemas.",
        "Soporte técnico, configuración de redes y monitoreo continuo."
      ]
    },
    {
      "company": "BullNet",
      "role": "Empleado IT",
      "period": "Feb 2010 - Sep 2012",
      "highlights": [
        "Las responsabilidades incluyeron ventas, soporte al cliente y configuración de sistemas."
      ]
    },
    {
      "company": "Cybercafé Maniac",
      "role": "Empleado General",
      "period": "Mar 2004 - Dic 2005",
      "highlights": [
        "Las responsabilidades incluyeron soporte al cliente y mantenimiento de redes."
      ]
    }
  ]
}
