{
  "experience": [
    {
      "company": "BiBank",
      "role": "DevOps Engineer | SRE",
      "period": "Mar 2024 – Presente",
      "highlights": [
        "Modernización y estandarización de flujos de CI/CD mediante el diseño de pipelines parametrizados y controlados, incrementando la confiabilidad de los despliegues y habilitando modelos self-service entre equipos.",
        "Fortalecimiento de la orquestación de contenedores y de la estabilidad de la plataforma en entornos productivos.",
        "Implementación de prácticas centralizadas de gestión de secretos en sistemas distribuidos.",
        "Reorganización y fortalecimiento de la observabilidad mediante soluciones de visibilidad rápida, normalización de métricas a través de una capa de servicio interna e integración de alertas basadas en umbrales en sistemas centralizados, promoviendo su adopción técnica en los equipos."
      ],
      "technologies": "Azure · Kubernetes (AKS, k3s) · Helm · GitLab CI · Jenkins · Elastic Stack · Zabbix · Kuma · Vault · Consul · Harbor · Proxmox · Docker Swarm"
    },
    {
      "company": "Fpay",
      "role": "DevOps | SRE",
      "period": "Ene 2021 – Mar 2024",
      "highlights": [
        "Referente DevOps para múltiples equipos de backend y frontend, acompañando el ciclo completo de despliegue y operación de microservicios en entornos cloud productivos.",
        "Evolución de la plataforma de automatización e infraestructura como código, fortaleciendo pipelines y acompañando la transición de Jenkins a GitLab CI.",
        "Operación y mantenimiento de infraestructura basada en Docker Swarm sobre Azure, asegurando estabilidad operativa en entornos distribuidos.",
        "Gestión de incidentes sobre componentes críticos de la plataforma, incluyendo gateway (KongHQ), mensajería y servicios de datos gestionados como MongoDB Atlas y BigQuery.",
        "Mejora de prácticas de observabilidad y monitoreo (ELK, Datadog) durante períodos de alta demanda."
      ],
      "technologies": "Azure · GCP · Docker Swarm · Kubernetes · Terraform · Jenkins · GitLab CI · Chef · KongHQ ·ELK · Datadog · Vault · Cloudflare · MongoDB Atlas · BigQuery"
    },
    {
      "company": "Technisys",
      "role": "Backend Developer (Fpay)",
      "period": "Sep 2019 – Ene 2021",
      "highlights": [
        "Desarrollo backend para una billetera de pagos multi-país, integrando procesadores y servicios financieros en distintos entornos regulatorios.",
        "Diseño e implementación de componentes backend para el procesamiento asincrónico de transacciones mediante colas de mensajería, gestionando persistencia, control de estados y manejo de reintentos.",
        "Implementación de integraciones con sistemas externos y colaboración en la trazabilidad y auditoría de operaciones financieras.",
        "Trabajo conjunto con equipos de infraestructura en despliegue, configuración y confiabilidad de servicios."
      ],
      "technologies": "Node.js · Express · RabbitMQ · MySQL · Redis · Docker · Jenkins · Kong · Instana · JWT · MongoDB"
    },
    {
      "company": "Technisys",
      "role": "Frontend Developer en Banco Itaú",
      "period": "Jul 2016 – Ago 2019",
      "highlights": [
        "Desarrollo y mantenimiento de la aplicación móvil de Home Banking para clientes del Banco Itaú.",
        "Desarrollo de componentes y servicios en Angular/Ionic para soportar flujos operativos multi-paso y validaciones del lado cliente.",
        "Resolución de problemas de compatibilidad y estilos entre plataformas móviles utilizando SASS y ajustes específicos por dispositivo.",
        "Integración con APIs bancarias y herramientas de analytics, participando en el proceso de build y publicación en stores (Android/iOS)."
      ],
      "technologies": "Angular · Ionic · TypeScript · RxJS · SASS · Cordova · REST APIs"
    },
    {
      "company": "DoWhale",
      "role": "Frontend Developer",
      "period": "Oct 2014 – Jul 2016",
      "highlights": [
        "Desarrollo de aplicaciones web responsive orientadas al público.",
        "Integración con APIs y foco en performance y usabilidad."
      ],
      "technologies": "JavaScript, HTML, CSS, diseño responsive, integración de APIs."
    },
    {
      "company": "Freelance",
      "role": "Consultor de Sistemas",
      "period": "Ago 2007 – Oct 2014",
      "highlights": [
        "Administración de sistemas y soporte de infraestructura para pequeñas y medianas empresas.",
        "Experiencia con servidores, redes, virtualización y backups."
      ],
      "technologies": "Servidores Linux, servidores Windows, equipos de red, plataformas de virtualización."
    },
    {
      "company": "Sirius IT Solutions",
      "role": "Propietario de Tienda IT",
      "period": "Jul 2011 - Oct 2013",
      "highlights": [
        "Venta de hardware y configuración de sistemas.",
        "Soporte técnico, configuración de redes y monitoreo continuo."
      ]
    },
    {
      "company": "BullNet",
      "role": "Empleado IT",
      "period": "Feb 2010 - Sep 2012",
      "highlights": [
        "Las responsabilidades incluyeron ventas, soporte al cliente y configuración de sistemas."
      ]
    },
    {
      "company": "Cybercafé Maniac",
      "role": "Empleado General",
      "period": "Mar 2004 - Dic 2005",
      "highlights": [
        "Las responsabilidades incluyeron soporte al cliente y mantenimiento de redes."
      ]
    }
  ]
}
